tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
tap "homebrew/cask"

# Unix
brew "ack"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "binutils"
brew "cmake"
brew "coreutils"
brew "diffutils"
brew "fd"
brew "findutils", args: ["with-default-names"]
brew "fswatch"
brew "fzf"
brew "gawk"
brew "git"
brew "git-cola"
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]
brew "htop"
brew "hub"
brew "iftop"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "libyaml"
brew "lua"
brew "make"
brew "mosh"
brew "mplayer"
brew "mtr"
brew "nethogs"
brew "nmap"
brew "openssh"
brew "openssl"
brew "pssh"
brew "pwgen"
brew "python3"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "rsync"
brew "screen"
brew "socat"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "universal-ctags", args: ["HEAD"]
brew "vagrant-completion"
brew "vim", args: ["with-lua"]
brew "watch"
brew "watchman"
brew "wget"
brew "wireshark"
brew "yarn"

# Applications
cask "adium"
cask "avidemux"
cask "caffeine"
cask "cyberduck"
cask "docker"
cask "emacs"
cask "gimp"
cask "google-chrome"
cask "gpg-suite"
cask "haroopad"
cask "hyperswitch"
cask "iterm2"
cask "karabiner-elements"
cask "libreoffice"
cask "lisanet-gimp"
cask "mattermost"
cask "microsoft-teams"
cask "yujitach-menumeters"
cask "simplenote"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "thunderbird"
cask "vagrant"
cask "vanilla"
cask "viber"
cask "virtualbox"
cask "vlc"
cask "vox"
cask "xquartz"
cask "zoomus"

# Testing
brew "qt@5.5" if MacOS::Xcode.installed?